---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.Normal
source: html/d3a3c025-f441-046a-5879-7023f019c2c1.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.Normal Property

A unit-length vector normal to the plane of the rebar

## Syntax (C#)
```csharp
public XYZ Normal { get; }
```